CSI API ETABS v1
cDetailing.GetDetailedSlabs Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedSlabs(
	ref int NumberItems,
	ref string[] Names,
	ref double[] SlabElevations,
	ref string[] GUIDs
)
Function GetDetailedSlabs (
	ByRef NumberItems As Integer,
	ByRef Names As String(),
	ByRef SlabElevations As Double(),
	ByRef GUIDs As String()
) As Integer
Dim instance As cDetailing
Dim NumberItems As Integer
Dim Names As String()
Dim SlabElevations As Double()
Dim GUIDs As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedSlabs(NumberItems,
	Names, SlabElevations, GUIDs)
int GetDetailedSlabs(
	int% NumberItems,
	array<String^>^% Names,
	array<double>^% SlabElevations,
	array<String^>^% GUIDs
)
abstract GetDetailedSlabs :
        NumberItems : int byref *
        Names : string[] byref *
        SlabElevations : float[] byref *
        GUIDs : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
Names
Type: System.String[]
SlabElevations
Type: System.Double[]
GUIDs
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace